app/Controllers/Api/UserController.php

public function getAllReservasi()
{
    $reservasiModel = new ReservasiModel();
    try {
        $data = $reservasiModel->findAll();
---
SELECT *
FROM `reservasi`