app/Controllers/ResepController.php

    public function list()
    {
        // Ambil semua data resep dari database
        $reseps = $this->resepModel->findAll();
---
SELECT *
FROM `resep`

    public function list_admin()
    {
        $reseps = $this->resepModel->findAll();
---
SELECT *
FROM `resep`

    public function delete($id)
    {
        if ($this->resepModel->delete($id)) {
---
DELETE FROM `resep`
WHERE `id` IN ('15')

    public function update($id)
    {
        $data = $this->request->getPost();

        // Validasi Input
        $rules = [
            'nama_resep' => 'required|string|max_length[255]',
            'catatan_resep' => 'required|string',
            'resep_makanan' => 'required|string',
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON(['error' => $this->validator->getErrors()]);
        }

        // Update Foto Jika Diupload
        if ($file = $this->request->getFile('foto_resep')) {
            if ($file->isValid() && !$file->hasMoved()) {
                $newName = $file->getRandomName();
                $file->move('uploads/resep', $newName);
                $data['foto_resep'] = 'uploads/resep/' . $newName;
            }
        }

        // Update Data di Database
        if ($this->resepModel->update($id, $data)) {
---
UPDATE `resep` SET `nama_resep` = 'mi ayam', `catatan_resep` = 'mi ayam rasa ayam', `resep_makanan` = '-'
WHERE `resep`.`id` IN ('16')